app/controllers/employees_controller.rb

SELECT "employees".* FROM "employees"
---
  def index
   @employees = Employee.all

SELECT "employees".* FROM "employees"  ORDER BY "employees"."age" ASC
---
  def sort_by_age
   @employees = Employee.order(:age)

SELECT "employees".* FROM "employees"  ORDER BY "employees"."department_id" ASC
---
   def sort_by_department
     @employees = Employee.order(:department_id)

SELECT "employees".* FROM "employees"  ORDER BY "employees"."salary" ASC
---
   def sort_by_salary
     @employees = Employee.order(:salary)

SELECT "employees".* FROM "employees" WHERE (age > 45)
---
   def retiredemp
     @employees = Employee.where('age > ?', 65)

SELECT  "employees".* FROM "employees"  ORDER BY "employees"."salary" DESC LIMIT 5
---
   def top_5_salary
     @employees = Employee.order(salary: :desc).limit(5)

SELECT  "employees".* FROM "employees"  ORDER BY "employees"."salary" DESC LIMIT 1
---
   def high_paid
     @employees = Employee.order(salary: :desc).limit(1)

SELECT  "employees".* FROM "employees"  ORDER BY "employees"."age" DESC LIMIT 5
---
   def top_5_senior_by_age
	 @employees =  Employee.order(age: :desc).limit(5)

SELECT  "employees".* FROM "employees"  ORDER BY "employees"."salary" ASC, "employees"."age" DESC LIMIT 1
---
   def low_salary_senior_company
     @employees = Employee.order(:salary, age: :desc).limit(1)

INSERT INTO "employees" ("name", "email", "age", "salary", "department_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Sandeep"], ["email", "san@con"], ["age", 25], ["salary", 131000], ["department_id", 1], ["created_at", "2017-03-19 05:21:11.505720"], ["updated_at", "2017-03-19 05:21:11.505720"]]
---
  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save

UPDATE "employees" SET "age" = ?, "salary" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["age", 97], ["salary", 5000], ["updated_at", "2017-03-19 20:58:36.473736"], ["id", 11]]
---
  def update
    respond_to do |format|
      if @employee.update(employee_params)

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT 1  [["id", 5]]
---
    def set_employee
      @employee = Employee.find(params[:id])